# TITANIC: Machine Learning del Desastre

## Objetivo
Durante el curso utilizaremos el Dataset de Titanic
Es tu trabajo predecir si un pasajero sobrevive al hundimiento del Titanic o no.
Para esto tenemos un set de datos de test, y el valor de la variable a predecir es 0 o 1.

## Los datos que provee este Dataset son:

* Survival - Survival (0=No, 1=Yes)
* Pclass - Ticket class 
     - A proxy for socio-economic status (SES) 
     - (1=1st=Upper, 2=2nd=Middle, 3=3rd=Lower) 
* Sex - Sex
* Age - Age in years
     - Age is fractional if less than 1. 
     - If the age is estimated, is it in the form of xx.5
* Sibsp - of siblings / spouses aboard the Titanic 
     - Sibling = brother, sister, stepbrother, stepsister
     - Spouse = husband, wife (mistresses and fiancés were ignored)
* Parch - of parents / children aboard the Titanic 
    - Parent = mother, father
    - Child = daughter, son, stepdaughter, stepson
    - Some children travelled only with a nanny, therefore parch=0 for them.
* Ticket - Ticket number 
* Fare - Passenger fare 
* Cabin - Cabin number 
* Embarked - Port of Embarkation (C=Cherbourg, Q=Queenstown, S=Southampton)

# Carga de librerías
Lo primero que tenemos que hacer cuando trabajamos con estos programas es cargar las librerías, por lo menos iniciales, con las que vamos a trabajar.

In [1]:
...

# Carga del dataset
Con las librerías cargadas vamos a cargar el dataset con el que vamos a trabajar de ahora en adelante.

### Dataset de Entrenamiento

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Dataset de testing

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

De acuerdo a lo que vimos hasta ahora, quisiera que encuentres las diferencias entre un set de datos y el otro.

# Descubriendo el Dataset
Como estuvimos viendo, es importante conocer los tipos de datos con los que contamos:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

# Recordar de documentar SIEMPRE

# En el próximo módulo comenzaremos a transformalo...